# Introduction of pandas Data Structure

### Series

In [1]:
import pandas as pd

In [2]:
a=pd.Series([1,2,3])

In [3]:
  print(a)

0    1
1    2
2    3
dtype: int64

In [4]:
a.values

array([1, 2, 3], dtype=int64)

In [5]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
a.describe

<bound method NDFrame.describe of 0    1
1    2
2    3
dtype: int64>

In [7]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
a[0]

1

In [9]:
a[1]

2

In [10]:
a[2]

3

In [11]:
a[a>0]

0    1
1    2
2    3
dtype: int64

In [12]:
a[a>1]

1    2
2    3
dtype: int64

In [13]:
a[a>2]

2    3
dtype: int64

In [14]:
a*2

0    2
1    4
2    6
dtype: int64

In [15]:
a*3

0    3
1    6
2    9
dtype: int64

# Series using Dictionary

In [16]:
data={'A':'Apple','B':'Ball','C':'Cat','D':'Dog'}

In [17]:
df=pd.Series(data)

In [18]:
df

A    Apple
B     Ball
C      Cat
D      Dog
dtype: object

In [19]:
states=['A1','B','C','D']

In [20]:
df1=pd.Series(data,index=states)

In [21]:
df1

A1     NaN
B     Ball
C      Cat
D      Dog
dtype: object

In [22]:
df1.isnull()

A1     True
B     False
C     False
D     False
dtype: bool

In [23]:
df1.isnull().sum()

1

In [24]:
df1.notnull()

A1    False
B      True
C      True
D      True
dtype: bool

In [25]:
df1.notnull().sum()

3

In [26]:
df1.describe()

count       3
unique      3
top       Cat
freq        1
dtype: object

In [27]:
df1+' '+df1

A1          NaN
B     Ball Ball
C       Cat Cat
D       Dog Dog
dtype: object

# DataFrame

In [28]:
data={1:[1,2,3,4],2:[4,5,6,7],3:[7,8,9,3],4:[4,6,8,1],5:[3,7,9,2]}

In [29]:
df=pd.DataFrame(data)

In [30]:
df

   1  2  3  4  5
0  1  4  7  4  3
1  2  5  8  6  7
2  3  6  9  8  9
3  4  7  3  1  2

In [31]:
df.head()

   1  2  3  4  5
0  1  4  7  4  3
1  2  5  8  6  7
2  3  6  9  8  9
3  4  7  3  1  2

In [32]:
df.tail()

   1  2  3  4  5
0  1  4  7  4  3
1  2  5  8  6  7
2  3  6  9  8  9
3  4  7  3  1  2

In [33]:
df.info

<bound method DataFrame.info of    1  2  3  4  5
0  1  4  7  4  3
1  2  5  8  6  7
2  3  6  9  8  9
3  4  7  3  1  2>

In [34]:
df.describe().T

   count  mean       std  min   25%  50%   75%  max
1    4.0  2.50  1.290994  1.0  1.75  2.5  3.25  4.0
2    4.0  5.50  1.290994  4.0  4.75  5.5  6.25  7.0
3    4.0  6.75  2.629956  3.0  6.00  7.5  8.25  9.0
4    4.0  4.75  2.986079  1.0  3.25  5.0  6.50  8.0
5    4.0  5.25  3.304038  2.0  2.75  5.0  7.50  9.0

In [35]:
df=pd.DataFrame(data,columns=[1,2])

In [36]:
df

   1  2
0  1  4
1  2  5
2  3  6
3  4  7

In [37]:
df=pd.DataFrame(data,columns=[1,2,3])

In [38]:
df

   1  2  3
0  1  4  7
1  2  5  8
2  3  6  9
3  4  7  3

# basic Pratice for dummy dataset

In [39]:
#import dataset
df=pd.read_csv('tips.csv')

In [40]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [41]:
df.isnull()

     total_bill    tip    sex  smoker    day   time   size
0         False  False  False   False  False  False  False
1         False  False  False   False  False  False  False
2         False  False  False   False  False  False  False
3         False  False  False   False  False  False  False
4         False  False  False   False  False  False  False
..          ...    ...    ...     ...    ...    ...    ...
239       False  False  False   False  False  False  False
240       False  False  False   False  False  False  False
241       False  False  False   False  False  False  False
242       False  False  False   False  False  False  False
243       False  False  False   False  False  False  False

[244 rows x 7 columns]

In [42]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [43]:
df.shape

(244, 7)

In [44]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [45]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [46]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [48]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [49]:
df1=pd.DataFrame(df,columns=['total_bill'])

In [50]:
df1.T

,0,1,2,3,4,5,6,7,8,9,...,234,235,236,237,238,239,240,241,242,243
total_bill,16.99,10.34,21.01,23.68,24.59,25.29,8.77,26.88,15.04,14.78,...,15.53,10.07,12.6,32.83,35.83,29.03,27.18,22.67,17.82,18.78

In [51]:
df1=pd.DataFrame(df,columns=['total_bill','day'])

In [52]:
df1

     total_bill   day
0         16.99   Sun
1         10.34   Sun
2         21.01   Sun
3         23.68   Sun
4         24.59   Sun
..          ...   ...
239       29.03   Sat
240       27.18   Sat
241       22.67   Sat
242       17.82   Sat
243       18.78  Thur

[244 rows x 2 columns]

# For Columns

In [53]:
df1=pd.DataFrame(df,columns=['total_bill','day','tip'])

In [54]:
df1.T

,0,1,2,3,4,5,6,7,8,9,...,234,235,236,237,238,239,240,241,242,243
total_bill,16.99,10.34,21.01,23.68,24.59,25.29,8.77,26.88,15.04,14.78,...,15.53,10.07,12.6,32.83,35.83,29.03,27.18,22.67,17.82,18.78
day,Sun,Sun,Sun,Sun,Sun,Sun,Sun,Sun,Sun,Sun,...,Sat,Sat,Sat,Sat,Sat,Sat,Sat,Sat,Sat,Thur
tip,1.01,1.66,3.5,3.31,3.61,4.71,2,3.12,1.96,3.23,...,3,1.25,1,1.17,4.67,5.92,2,2,1.75,3

In [55]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [56]:
df.total_bill

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [57]:
df.day

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day, Length: 244, dtype: object

# For Index

In [58]:
df2=pd.DataFrame(df,index=[1,2,3])

In [59]:
 df2

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2

In [60]:
df2.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [61]:
df2.index

Int64Index([1, 2, 3], dtype='int64')

In [62]:
df.values

array([[16.99, 1.01, 'Female', ..., 'Sun', 'Dinner', 2],
       [10.34, 1.66, 'Male', ..., 'Sun', 'Dinner', 3],
       [21.01, 3.5, 'Male', ..., 'Sun', 'Dinner', 3],
       ...,
       [22.67, 2.0, 'Male', ..., 'Sat', 'Dinner', 2],
       [17.82, 1.75, 'Male', ..., 'Sat', 'Dinner', 2],
       [18.78, 3.0, 'Female', ..., 'Thur', 'Dinner', 2]], dtype=object)

# Reindex basic Operation

# Series

In [63]:
obj=pd.Series([1,2,3,4],index=['d','b','a','c'])

In [64]:
obj

d    1
b    2
a    3
c    4
dtype: int64

In [65]:
obj2=obj.reindex(['a','b','c','d'])

In [66]:
obj2

a    3
b    2
c    4
d    1
dtype: int64

# DataFrame

In [67]:
import numpy as np

In [68]:
frame=pd.DataFrame(np.arange(9).reshape(3,3))

In [69]:
frame

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [70]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['A','D','B'])

In [71]:
frame

   0  1  2
A  0  1  2
D  3  4  5
B  6  7  8

In [72]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['A','D','B'],columns=['Data1','data2','data3'])

In [73]:
frame

   Data1  data2  data3
A      0      1      2
D      3      4      5
B      6      7      8

In [74]:
frame2=frame.reindex(['D','A','B'])

In [75]:
frame2

   Data1  data2  data3
D      3      4      5
A      0      1      2
B      6      7      8

In [76]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [77]:
df1=df.head(5)

In [78]:
df1

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [79]:
df.reindex([4,3,2,1,0])

   total_bill   tip     sex smoker  day    time  size
4       24.59  3.61  Female     No  Sun  Dinner     4
3       23.68  3.31    Male     No  Sun  Dinner     2
2       21.01  3.50    Male     No  Sun  Dinner     3
1       10.34  1.66    Male     No  Sun  Dinner     3
0       16.99  1.01  Female     No  Sun  Dinner     2

In [80]:
df.reindex([213])

     total_bill  tip     sex smoker  day    time  size
213       13.27  2.5  Female    Yes  Sat  Dinner     2

In [81]:
df.reindex([203])

     total_bill  tip     sex smoker   day   time  size
203        16.4  2.5  Female    Yes  Thur  Lunch     2

# Data Wrangling: Join, Combine, and Reshape

## Hierarchical Indexing

#### Hierarchical Index is an important features of pandas that enabes you have multiple(Two or More) Index Level on an Axis.

In [82]:
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [83]:
data

a  1    0.506172
   2   -0.300354
   3   -0.727499
b  1   -1.469642
   3    2.719239
c  1    0.856872
   2   -0.868208
d  2    0.399098
   3   -0.141060
dtype: float64

In [84]:
data=pd.Series(np.random.randn(9),index=[['a','a','b','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [85]:
data

a  1    1.494317
   2    1.415285
b  3   -2.988314
   1   -0.082257
   3    0.918958
c  1   -1.162931
   2    2.172814
d  2    1.192951
   3    0.748373
dtype: float64

In [86]:
data=pd.Series(np.random.randn(9),index=[['a','a','b','b','b','b','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [87]:
data

a  1   -0.550267
   2    2.055403
b  3   -2.531739
   1   -0.304776
   3   -0.483917
   1   -1.071204
c  2    1.873554
d  2   -1.982113
   3   -0.632857
dtype: float64

In [88]:
data=pd.Series(np.random.randn(9),index=[['b','b','b','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [89]:
data

b  1    0.809479
   2    0.410416
   3    1.299184
   1   -0.353870
   3    2.408657
c  1    0.680569
   2    0.348461
d  2    0.096133
   3    0.614612
dtype: float64

In [90]:
data=pd.Series(np.random.randn(9),index=[['b','b','b','b','b','b','b','b','b'],[1,2,3,1,3,1,2,2,3]])

In [91]:
data

b  1    1.217879
   2    0.024409
   3   -1.803917
   1    1.340608
   3   -1.323823
   1   -1.127787
   2    0.191229
   2   -2.109064
   3   -1.516940
dtype: float64

In [92]:
data=pd.Series(np.random.randn(9),index=[['a','b','c','d','e','f','g','h','g'],[1,2,3,1,3,1,2,2,3]])

In [93]:
data

a  1    0.164934
b  2    0.772401
c  3   -0.220299
d  1    0.794606
e  3   -0.414973
f  1    0.665718
g  2   -0.784890
h  2   -1.869068
g  3   -0.686867
dtype: float64

In [94]:
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [95]:
data

a  1    0.342132
   2   -0.509580
   3   -0.038197
b  1    0.275309
   3    1.817915
c  1    2.114705
   2   -0.677687
d  2   -0.683964
   3    1.118693
dtype: float64

In [96]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [97]:
data.describe()

count    9.000000
mean     0.417703
std      1.051132
min     -0.683964
25%     -0.509580
50%      0.275309
75%      1.118693
max      2.114705
dtype: float64

In [98]:
data['b':'c']

b  1    0.275309
   3    1.817915
c  1    2.114705
   2   -0.677687
dtype: float64

In [99]:
data['c']

1    2.114705
2   -0.677687
dtype: float64

In [100]:
data['a']

1    0.342132
2   -0.509580
3   -0.038197
dtype: float64

In [101]:
data

a  1    0.342132
   2   -0.509580
   3   -0.038197
b  1    0.275309
   3    1.817915
c  1    2.114705
   2   -0.677687
d  2   -0.683964
   3    1.118693
dtype: float64

In [102]:
data.unstack()#rearrange the data into a dataFrame using its unstack Method

          1         2         3
a  0.342132 -0.509580 -0.038197
b  0.275309       NaN  1.817915
c  2.114705 -0.677687       NaN
d       NaN -0.683964  1.118693

In [103]:
data.unstack().stack()

a  1    0.342132
   2   -0.509580
   3   -0.038197
b  1    0.275309
   3    1.817915
c  1    2.114705
   2   -0.677687
d  2   -0.683964
   3    1.118693
dtype: float64

In [104]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [105]:
df3=df.unstack()

In [106]:
df3.head()

total_bill  0    16.99
            1    10.34
            2    21.01
            3    23.68
            4    24.59
dtype: object

In [107]:
df3.tail()

size  239    3
      240    2
      241    2
      242    2
      243    2
dtype: object

In [108]:
df3.index

MultiIndex([('total_bill',   0),
            ('total_bill',   1),
            ('total_bill',   2),
            ('total_bill',   3),
            ('total_bill',   4),
            ('total_bill',   5),
            ('total_bill',   6),
            ('total_bill',   7),
            ('total_bill',   8),
            ('total_bill',   9),
            ...
            (      'size', 234),
            (      'size', 235),
            (      'size', 236),
            (      'size', 237),
            (      'size', 238),
            (      'size', 239),
            (      'size', 240),
            (      'size', 241),
            (      'size', 242),
            (      'size', 243)],
           length=1708)

In [109]:
df3.describe()

count     1708.0
unique     361.0
top          2.0
freq       189.0
dtype: float64

In [110]:
df3=df.stack()#inverse of unstack is stack

In [111]:
df3

0    total_bill     16.99
     tip             1.01
     sex           Female
     smoker            No
     day              Sun
                    ...
243  sex           Female
     smoker            No
     day             Thur
     time          Dinner
     size               2
Length: 1708, dtype: object

In [112]:
df3[3]

total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
dtype: object

In [113]:
df3[5]

total_bill     25.29
tip             4.71
sex             Male
smoker            No
day              Sun
time          Dinner
size               4
dtype: object

# DataFrame, eihter  axis can have a hierarchical Index

In [114]:
frame=pd.DataFrame(np.arange(12).reshape(4,3))

In [115]:
frame

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [116]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),index=[['a','a','b','b'],[1,2,1,2]],columns=[['A','B','C'],['D','E','F']])

In [117]:
frame

     A   B   C
     D   E   F
a 1  0   1   2
  2  3   4   5
b 1  6   7   8
  2  9  10  11

In [118]:
frame.index.names=['key1','key2']

In [119]:
frame.columns.names=['X','Y']

In [120]:
frame

X          A   B   C
Y          D   E   F
key1 key2
a    1     0   1   2
     2     3   4   5
b    1     6   7   8
     2     9  10  11

# Indexing with DataFrames's Columns

In [121]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1)})

In [122]:
frame

   a  b
0  0  7
1  1  6
2  2  5
3  3  4
4  4  3
5  5  2
6  6  1

In [123]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [124]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [125]:
#DataFrame's set_index function is create a new DataFrame using one or more of its columns as the index

In [126]:
frame2=frame.set_index(['c','d'])

In [127]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [128]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [129]:
frame3=frame.set_index(['a','b'])

In [130]:
frame3

       c  d
a b
0 7  one  0
1 6  one  1
2 5  one  2
3 4  two  0
4 3  two  1
5 2  two  2
6 1  two  3

In [131]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [132]:
frame2=frame.set_index(['c','d'])

In [133]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [134]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [135]:
frame3=frame.set_index(['c','d'],drop=False)#By default the columns are removed from the dataFrame

In [136]:
frame3

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [137]:
frame4=frame.set_index(['c','d'])

In [138]:
frame4

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

# Reset_index Function

### The Opposite of set_index Function

In [139]:
frame4

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [140]:
frame4.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# Combine and merge DataSets

## Pandas.Merge Function

## >  pandas.merge connects rows in the DataFrames based on one or more keys.

### > This will be Familiar to users of SQL or other relational Databases, as it implements database join operation

## pandas.Concat Function

## > pandas.concat concatenates or "Stack" together object along an axis

# Database-style DataFrame join

## Merge or join operators combine datasets by linking rows using one or more keys.

#

In [141]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [142]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [143]:
df2=pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [144]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

# Many-to-one join Function

In [145]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [146]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [147]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [148]:
pd.merge(df2,df1)

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

In [149]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [150]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [151]:
df4=pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [152]:
print(df3)
print('\n')
print(df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6


  rkey  data2
0    a      0
1    b      1
2    d      2

In [153]:
df5=pd.merge(df3,df4,left_on='lkey',right_on='rkey')

In [154]:
df5

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [155]:
print(df3)
print('\n')
print(df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6


  rkey  data2
0    a      0
1    b      1
2    d      2

In [156]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [157]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [158]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [159]:
df4=pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [160]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [161]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [162]:
df5=pd.merge(df3,df4,left_on='lkey',right_on='rkey')

In [163]:
df5

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

# Many-to-many Merge Function

In [164]:
x=pd.DataFrame({'key':['b','b','a','c','a','b'],'dat1':range(6)})

In [165]:
y=pd.DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})

In [166]:
print(x)
print(y)

  key  dat1
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   b     5
  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

# Basic Operators by merge function

In [167]:
pd.merge(x,y)

  key  dat1  data2
0   b     0      1
1   b     0      3
2   b     1      1
3   b     1      3
4   b     5      1
5   b     5      3
6   a     2      0
7   a     2      2
8   a     4      0
9   a     4      2

# on Function

In [168]:
print(x)
print(y)

  key  dat1
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   b     5
  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [169]:
pd.merge(x,y,on='key')

  key  dat1  data2
0   b     0      1
1   b     0      3
2   b     1      1
3   b     1      3
4   b     5      1
5   b     5      3
6   a     2      0
7   a     2      2
8   a     4      0
9   a     4      2

# How = Left Function

In [170]:
print(x)
print(y)

  key  dat1
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   b     5
  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [171]:
pd.merge(x,y,on='key',how='left')

   key  dat1  data2
0    b     0    1.0
1    b     0    3.0
2    b     1    1.0
3    b     1    3.0
4    a     2    0.0
5    a     2    2.0
6    c     3    NaN
7    a     4    0.0
8    a     4    2.0
9    b     5    1.0
10   b     5    3.0

# how='right'

In [172]:
print(x)
print(y)

  key  dat1
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   b     5
  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [173]:
pd.merge(x,y,on='key',how='right')

   key  dat1  data2
0    a   2.0      0
1    a   4.0      0
2    a   2.0      2
3    a   4.0      2
4    b   0.0      1
5    b   1.0      1
6    b   5.0      1
7    b   0.0      3
8    b   1.0      3
9    b   5.0      3
10   d   NaN      4

# how='outer'

In [174]:
print(x)
print(y)

  key  dat1
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   b     5
  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [175]:
pd.merge(x,y,on='key',how='outer')

   key  dat1  data2
0    b   0.0    1.0
1    b   0.0    3.0
2    b   1.0    1.0
3    b   1.0    3.0
4    b   5.0    1.0
5    b   5.0    3.0
6    a   2.0    0.0
7    a   2.0    2.0
8    a   4.0    0.0
9    a   4.0    2.0
10   c   3.0    NaN
11   d   NaN    4.0

# how='inner'

In [176]:
print(x)
print(y)

  key  dat1
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   b     5
  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [177]:
pd.merge(x,y,on='key',how='inner')

  key  dat1  data2
0   b     0      1
1   b     0      3
2   b     1      1
3   b     1      3
4   b     5      1
5   b     5      3
6   a     2      0
7   a     2      2
8   a     4      0
9   a     4      2